app/views/albums/index.html.erb

SELECT "albums".* FROM "albums"
SELECT COUNT(*) FROM "albums" WHERE "albums"."user_id" = ?  [["user_id", 1]]
---
 <h4 class="text-right">
    All Contacts <span class="badge"><%= current_user.albums.count %></span>