app/controllers/albums_controller.rb

SELECT "albums".* FROM "albums" WHERE "albums"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 2], ["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(*) FROM "albums" WHERE "albums"."user_id" = ?  [["user_id", 2]]
---
  def index
    @albums = current_user.albums.paginate(page: params[:page], per_page: 4)

INSERT INTO "albums" ("name", "phone", "email", "address", "user_id", "created_at", "updated_at", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    ash = album_params;
    ash[:user_id] = current_user.id;
    @album =  Album.new(ash);

    respond_to do |format|
      if @album.save

UPDATE "albums" SET "name" = ?, "avatar_file_name" = ?, "avatar_file_size" = ?, "avatar_updated_at" = ?, "updated_at" = ? WHERE "albums"."id" = ?  [["name", "Samuel Cornet"], ["avatar_file_name", "3.png"], ["avatar_file_size", 70829], ["avatar_updated_at", "2019-05-23 17:02:20.274205"], ["updated_at", "2019-05-23 17:02:20.462706"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @album.update(album_params)

SELECT "albums".* FROM "albums" WHERE "albums"."user_id" = ? AND "albums"."id" = ? LIMIT ?  [["user_id", 1], ["id", 2], ["LIMIT", 1]]
---
 def find_album
    @album = current_user.albums.find(params[:id])