app/controllers/sessions_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "uid", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "2328084424147750"], ["LIMIT", 1]]
---
  def facebookcreate
    @user = User.find_or_create_by(uid: auth['uid']) do |u|